# Python Fundamentals - Exercise 4.9 (Part 1)

## 3. Import Libraries as well as new customer dataset as a dataframe

In [2]:
#Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
#Create Path
path = r'/Users/puneet/Desktop/Instacart Basket Analysis 08-2025'

In [10]:
#Import 'customers' dataframe
df_customers = pd.read_csv(os.path.join(path,'02 Data', 'Original Data', 'customers.csv'))

### -

## 4. Wrangling New Customers Data 
## & 
## 5. Data Quality and Consistency Check

In [11]:
#Check new dataframe
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
#Check shape
df_customers.shape

(206209, 10)

### Change column names

In [16]:
#Change column names
df_customers = df_customers.rename(columns = {'First Name':'first_name',
                                'Surnam':'last_name',
                                'Gender':'gender',
                                'STATE':'state',
                                'Age':'age',
                                'n_dependants':'number_of_dependants',
                               'fam_status':'family_status'})

In [17]:
#Check new columns
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### *New column names look good*

In [19]:
#Check data types for columns
df_customers.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [22]:
#Check info about customers dataframe
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            194950 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   family_status         206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### Check for mixed-type columns

In [35]:
#Check for mixed-type data
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

#### first_name column has mixed-type data. Need to change it to string

In [36]:
#Change first_name to string
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [38]:
#Check data types again
df_customers.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [56]:
#Check mixed data again
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

####  *Data columns and types look good*

In [43]:
#Check description of numeric value columns
df_customers.describe()

             user_id            age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

#### *Min, Max, Count, and all numeric data look good. Nothing out of the ordinary, no negative numbers or high ages. Count of rows is correct*

### -

### Missing Values and Duplicates

In [40]:
#Check missing values
df_customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

#### *No missing values located*

In [41]:
#Create dataframe for duplicate check
customers_dups = df_customers.duplicated()

In [42]:
#Check duplicate row count for dups subset dataframe
customers_dups.value_counts()

False    206209
Name: count, dtype: int64

#### *No duplicates located*

## -

## 6. Combine new customer data with prepared instacart data

- Import prepared instacart data from previous exercise

In [45]:
#Import prepared instacart data
df_ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_E48.pkl'))

In [46]:
#Check instacart data
df_ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,spending_flag,spender_type,median_flag,customer_frequency
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid range product,Regularly busy,Regular days,Average hours,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Mid range product,Regularly busy,Regular days,Average hours,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Low range product,Regularly busy,Regular days,Average hours,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Low range product,Regularly busy,Regular days,Average hours,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Low range product,Regularly busy,Regular days,Average hours,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [49]:
#Check shape of instacart data
df_ords_prods_merge.shape

(32404859, 24)

In [48]:
#Check datatypes for columns (user_id must match as a string)
df_ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_the_week       int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
spending_flag              float64
spender_type                object
median_flag                float64
customer_frequency          object
dtype: object

#### user_id column is currently an integer column, no need to change

#### Check unique row counts for both dataframes, for comparison

In [59]:
#Check customer dataframe unique user_id values
df_customers['user_id'].nunique()

206209

In [61]:
#Check merged instacart data for unique user_id values
df_ords_prods_merge['user_id'].nunique()

206209

#### *Ready to merge both dataframes*

In [66]:
#Merging customer data with instacart data
df_merged = df_ords_prods_merge.merge(df_customers, on ='user_id', how = 'inner')

In [67]:
# Check new dataframe shape
df_merged.shape

(32404859, 33)

In [68]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,customer_frequency,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

#### *New merged dataframe has been created with correct columns, everything looks good*

## -

## 8. Export new dataframe as a pickle file

In [69]:
#Export dataframe as pickle file
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_cust_merge_E49.pkl'))